Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

terraform
module.dev_project.google_project.project: Refreshing state... [id=projects/lz-dev-470416]
module.mgmt_project.google_project.project: Refreshing state... [id=projects/lz-mgmt-470415]
module.dev_project.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=lz-dev-470416/compute.googleapis.com]
module.dev_project.google_project_service.services["logging.googleapis.com"]: Refreshing state... [id=lz-dev-470416/logging.googleapis.com]
module.dev_project.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=lz-dev-470416/iam.googleapis.com]
module.mgmt_project.google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/iam.googleapis.com]
module.mgmt_project.google_project_service.services["storage.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/storage.googleapis.com]
module.mgmt_project.google_project_service.services["logging.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/logging.googleapis.com]
module.mgmt_project.google_project_service.services["compute.googleapis.com"]: Refreshing state... [id=lz-mgmt-470415/compute.googleapis.com]
module.iam.google_service_account.dev_sa: Refreshing state... [id=projects/lz-dev-470416/serviceAccounts/dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.iam.google_service_account.monitoring_sa: Refreshing state... [id=projects/lz-mgmt-470415/serviceAccounts/monitoring@lz-mgmt-470415.iam.gserviceaccount.com]
module.networking.google_compute_network.mgmt_vpc: Refreshing state... [id=projects/lz-mgmt-470415/global/networks/mgmt-vpc]
module.networking.google_compute_network.dev_vpc: Refreshing state... [id=projects/lz-dev-470416/global/networks/dev-vpc]
module.monitoring.google_storage_bucket.logging_bucket: Refreshing state... [id=lz-mgmt-470415-logs]
module.monitoring.google_logging_project_sink.dev_sink: Refreshing state... [id=projects/lz-dev-470416/sinks/centralized-sink]
module.monitoring.google_logging_project_sink.mgmt_sink: Refreshing state... [id=projects/lz-mgmt-470415/sinks/centralized-sink]
module.iam.google_project_iam_member.monitoring_sa_logging: Refreshing state... [id=lz-mgmt-470415/roles/logging.admin/serviceAccount:monitoring@lz-mgmt-470415.iam.gserviceaccount.com]
module.iam.google_project_iam_member.dev_sa_compute: Refreshing state... [id=lz-dev-470416/roles/compute.instanceAdmin/serviceAccount:dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.iam.google_project_iam_member.dev_sa_logging: Refreshing state... [id=lz-dev-470416/roles/logging.logWriter/serviceAccount:dev-compute@lz-dev-470416.iam.gserviceaccount.com]
module.networking.google_compute_firewall.dev_allow_ssh: Refreshing state... [id=projects/lz-dev-470416/global/firewalls/allow-ssh]
module.networking.google_compute_firewall.dev_allow_internal: Refreshing state... [id=projects/lz-dev-470416/global/firewalls/allow-internal]
module.monitoring.google_storage_bucket_iam_member.mgmt_sink_writer: Refreshing state... [id=b/lz-mgmt-470415-logs/roles/storage.objectCreator/serviceAccount:service-260175548593@gcp-sa-logging.iam.gserviceaccount.com]
module.monitoring.google_storage_bucket_iam_member.dev_sink_writer: Refreshing state... [id=b/lz-mgmt-470415-logs/roles/storage.objectCreator/serviceAccount:service-769964366039@gcp-sa-logging.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.networking.google_compute_network.mgmt_vpc must be replaced
-/+ resource "google_compute_network" "mgmt_vpc" {
      ~ bgp_always_compare_med                    = false -> (known after apply)
      ~ bgp_best_path_selection_mode              = "LEGACY" -> (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      - description                               = "Management VPC for shared resources like Cloud SQL, Cloud Storage" -> null # forces replacement
      - enable_ula_internal_ipv6                  = false -> null
      + gateway_ipv4                              = (known after apply)
      ~ id                                        = "projects/lz-mgmt-470415/global/networks/mgmt-vpc" -> (known after apply)
      + internal_ipv6_range                       = (known after apply)
      ~ mtu                                       = 0 -> (known after apply)
        name                                      = "mgmt-vpc"
      ~ network_id                                = "1944117422036252988" -> (known after apply)
      ~ numeric_id                                = "1944117422036252988" -> (known after apply)
      ~ routing_mode                              = "REGIONAL" -> (known after apply)
      ~ self_link                                 = "https://www.googleapis.com/compute/v1/projects/lz-mgmt-470415/global/networks/mgmt-vpc" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.networking.google_compute_subnetwork.dev_subnet will be created
  + resource "google_compute_subnetwork" "dev_subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.1.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "dev-subnet"
      + network                    = "projects/lz-dev-470416/global/networks/dev-vpc"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "lz-dev-470416"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*